import { useState } from "react"
// import {front} from './front.svg'

export default function App(){
    let [ShowFront, setShowFront] = useState(true)

    return(
        <div className="container" onClick={() => {
            setShowFront((prev) => !prev)
        }}>
            <img className={"front" + (ShowFront ? " show" : " hide")} src="front.png" alt=""/>
            <div className={"tip" + (ShowFront ? "" : " dis")}>Мене можна <span className="pretty">натиснути</span>!</div>
            <div className={"tip2" + (ShowFront ? "" : " dis")}>Натисни на мене 🥺</div>
            <div className={"back" + (ShowFront ? " hide" : " show")}>
                <img className="rose" src="rose.png" alt="" />
                <div className="text">
                    З днем народження тебе, моє дороге щастячко, моя Оленька! 💞💞🥰🥰  Бажаю тобі всього найліпшого, матеріалізації всіх твоїх бажань та амбіцій, щоб ти завжди була здорова і щаслива! 💞💞💞💞💞😘😘 Щоб тобі ніколи не було боляче і не турбували переживання, а весь сум та неприємні почуття ти ділила зі мною, я завжди підтримаю та допоможу ❤️❤️❤️🥺🥺🥺 Хочу проживати все разом, відчувати все що й ти, розділити з тобою все хороше і погане, що буде у нашому житті 💕💕💕💕❤️❤️ Я дуже дуже сильно тебе кохаю, а кожна хвилина, яку я проводжу з тобою приносить мені щастя та спокій 💞💞💞💞 Ти - людина, якої мені так не вистачало, з якою я почуваю себе так добре та легко на душі 💞💞💞💞🥰🥰🥰🥰 Мені хочеться, щоб ми завжди були щасливі разом 💞💞💞💞💞💞😘😘😘😘 Мені так сильно хочеться зараз бути поряд, обіймати тебе та цілувати, брати на ручки та кружити, покласти тебе на ліжечко та ніжно няшити 💕💕💕😘😘😘 Хочу назавжди бути твоїм та поряд 💞💞💞🥰🥰🥰 Ти моє Щастячко, моя Няшка, моя Оленька 💞💞💞💞💞🥰🥰🥰🥰🥰🥰 З днем народження, моє Життя! 💞💞💓💓🥰🥰
                </div>
            </div>
            <img className={"bg" +(ShowFront ? " big" : " smaller")} src = "roses_bg.png"></img>
        </div>
    )
}